cf/BusinessProcesses/ВнутренняяЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>ВнутренняяЗаявка</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/Enums/СостоянияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСборку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСкладПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгруженЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобранЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьЗаявку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьИнструмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьГарантию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвестиДефектовку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьНаСкладВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредупредитьКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПоТехническимПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Когда товар отправлен в доставку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
					<Comment>Когда товар принял получатель или транспортная компания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/СтатусыВнутреннегоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыВнутреннегоЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/BusinessProcesses/ВнутренняяЗаявка/Forms/ФормаСписка/Ext/Form/Module.bsl
// ОТОБРАЖЕНИЕ

&НаСервере
Процедура ОбновитьСостоПроцеяние()

	Список.Параметры.УстановитьЗначениеПараметра("ВыбраноСостояние", 	Не Состояние.Пустая());
	Список.Параметры.УстановитьЗначениеПараметра("Состояние", 			Состояние);
	
КонецПроцедуры

// ТИПОВЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеЧерновик", Перечисления.СостоянияЗаказа.Черновик);
	
	ОбновитьСостоПроцеяние();
	
КонецПроцедуры

// ЭЛЕМЕНТЫ

&НаКлиенте
Процедура СостояниеФильтрПриИзменении(Элемент)
	
	ОбновитьСостоПроцеяние();
	
КонецПроцедуры
&НаКлиенте
Процедура СостояниеФильтрОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьСостоПроцеяние();
	
КонецПроцедуры
&НаКлиенте
Процедура ТолькоМоиПриИзменении(Элемент)
	
	ОбновитьСостоПроцеяние();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Найти("ФормаДокументВыдачаНаМОЛСоздатьНаОсновании") = Неопределено Тогда
		Возврат
	КонецЕсли;
	ТД = Элементы.Список.ТекущиеДанные;
	Элементы.ФормаДокументВыдачаНаМОЛСоздатьНаОсновании.Доступность = ПолучитьДоступностьДляЭлементовВводаНаОсновании(ТД.Заказ, ТД.Состояние);
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьДоступностьДляЭлементовВводаНаОсновании(Заказ,Состояние)
	Если Заказ.Статус = Перечисления.СтатусыВнутреннегоЗаказа.Согласовано И НЕ Заказ.ОснованиеВыдачиИнструмента.Пустая() 
		И Состояние = Перечисления.СостоянияЗаказа.Отгружен Тогда
		ФлагДоступность = Истина;
	Иначе
		ФлагДоступность = Ложь;
	КонецЕсли;
	 Возврат ФлагДоступность;
КонецФункции
